{"config": [{"config": {"batch_input_shape": [null, null], "input_dim": 7000, "name": "embedding_1", "init": "uniform", "W_constraint": null, "trainable": true, "activity_regularizer": null, "mask_zero": false, "input_length": null, "input_dtype": "int32", "W_regularizer": null, "dropout": 0.2, "output_dim": 256}, "class_name": "Embedding"}, {"config": {"trainable": true, "input_dim": 256, "name": "lstm_1", "init": "glorot_uniform", "activation": "tanh", "stateful": false, "forget_bias_init": "one", "inner_activation": "hard_sigmoid", "unroll": false, "input_length": null, "return_sequences": false, "consume_less": "cpu", "go_backwards": false, "b_regularizer": null, "dropout_U": 0.2, "W_regularizer": null, "output_dim": 16, "U_regularizer": null, "dropout_W": 0.2, "inner_init": "orthogonal"}, "class_name": "LSTM"}, {"config": {"b_constraint": null, "b_regularizer": null, "name": "dense_1", "init": "glorot_uniform", "W_constraint": null, "input_dim": null, "trainable": true, "activity_regularizer": null, "bias": true, "activation": "linear", "W_regularizer": null, "output_dim": 1}, "class_name": "Dense"}, {"config": {"name": "activation_1", "trainable": true, "activation": "sigmoid"}, "class_name": "Activation"}], "keras_version": "1.1.1", "class_name": "Sequential"}