{"class_name": "Sequential", "config": [{"class_name": "Embedding", "config": {"name": "embedding_1", "trainable": true, "input_dim": 7000, "batch_input_shape": [null, null], "init": "uniform", "mask_zero": false, "input_dtype": "int32", "input_length": null, "W_constraint": null, "dropout": 0.2, "activity_regularizer": null, "W_regularizer": null, "output_dim": 256}}, {"class_name": "LSTM", "config": {"name": "lstm_1", "trainable": true, "input_dim": 256, "init": "glorot_uniform", "inner_activation": "hard_sigmoid", "dropout_U": 0.2, "input_length": null, "go_backwards": false, "consume_less": "cpu", "return_sequences": false, "b_regularizer": null, "inner_init": "orthogonal", "stateful": false, "W_regularizer": null, "unroll": false, "forget_bias_init": "one", "output_dim": 16, "U_regularizer": null, "dropout_W": 0.2, "activation": "tanh"}}, {"class_name": "Dense", "config": {"name": "dense_1", "trainable": true, "activity_regularizer": null, "init": "glorot_uniform", "bias": true, "b_constraint": null, "W_constraint": null, "b_regularizer": null, "input_dim": null, "W_regularizer": null, "output_dim": 1, "activation": "linear"}}, {"class_name": "Activation", "config": {"name": "activation_1", "trainable": true, "activation": "sigmoid"}}], "keras_version": "1.1.1"}